Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The `quarkus:generate-code` goal is executed by default during the Quarkus Maven plugin default lifecycle when using the `quarkus` packaging, and will handle the code generation.
ja_jp: `quarkus:generate-code` ゴールは、`quarkus` パッケージングを使用する際に、Quarkus Maven プラグインのデフォルトライフサイクル中にデフォルトで実行され、コード生成を処理します。

source: The `quarkus:update` goal (currently marked as 'experimental') provided by the Quarkus Maven plugin can be used to check whether there are Quarkus-related updates available for a project, such as: new releases of the relevant Quarkus platform BOMs and non-platform Quarkus extensions present in the project. In a multi-module project the `update` goal is meant to be executed from the main Quarkus application module.
ja_jp: QuarkusMaven プラグインによって提供される `quarkus:update` ゴール (現在は 'experimental' としてマークされています) を使用して、プロジェクトで利用可能な Quarkus 関連の更新があるかどうかを確認できます。たとえば、プロジェクトに存在する関連する Quarkus プラットフォーム の BOM やプラットフォーム以外の Quarkus エクステンションの新リリースが挙げられます。マルチモジュールプロジェクトでは、 `update` ゴールはメインの Quarkus アプリケーションモジュールから実行されることを想定しています。

source: The `quarkusBuild` task is responsible for building the Quarkus application. The `quarkusAppPartsBuild` and `quarkusDependenciesBuild` tasks do nothing for `uber-jar`s.
ja_jp: `quarkusBuild` タスクは、Quarkusアプリケーションのビルドを担当します。 `quarkusAppPartsBuild` および `quarkusDependenciesBuild` タスクは `uber-jar` に対しては何も行いません。

source: The `quarkus` command lets you create projects, manage extensions and do essential build and dev commands using the underlying project build tool.
ja_jp: `quarkus` コマンドを使用すると、プロジェクトを作成し、エクステンションを管理し、基盤となるプロジェクトビルドツールを使用して重要なビルドおよび開発コマンドを実行できます。

source: The `quarkus` command lets you create projects, manage extensions and do essential build and development tasks using the underlying project build tool.
ja_jp: `quarkus` コマンドを使用すると、プロジェクトの作成、エクステンションの管理、基盤となるプロジェクトビルドツールを使用したビルドと開発の必須タスクを行うことができます。

source: The `quay.io/keycloak/keycloak-x:16.0.0` image which contains a `Keycloak-X` distribution powered by `Quarkus` is used to start a container by default. `quarkus.keycloak.devservices.image-name` can be used to change the Keycloak image name. For example, set it to `quay.io/keycloak/keycloak:16.0.0` to use a `Keycloak` distribution powered by `WildFly`.
ja_jp: デフォルトでは、 `Quarkus` によって動作する `Keycloak-X` ディストリビューションを含む `quay.io/keycloak/keycloak-x:16.0.0` イメージがコンテナの起動に使用されます。 `quarkus.keycloak.devservices.image-name` を使用して、Keycloak イメージ名を変更できます。たとえば、 `WildFly` によって動作する `Keycloak` ディストリビューションを使用するには、 `quay.io/keycloak/keycloak:16.0.0` に設定します。

source: The `quay.io/keycloak/keycloak:15.0.2` image which contains a `Keycloak` distribution powered by `WildFly` is currently used to start a container by default. See the <<keycloak-initialization, Keycloak Initialization>> section for more details about the image selection.
ja_jp: 現在、コンテナの起動には、 `WildFly` を搭載した `Keycloak` ディストリビューションを含む `quay.io/keycloak/keycloak:15.0.2` イメージがデフォルトで使用されています。イメージの選択の詳細については、 xref:keycloak-initialization[Keycloakの初期化] のセクションを参照してください。

source: The `quay.io/keycloak/keycloak:17.0.0` image which contains a Keycloak distribution powered by Quarkus is used to start a container by default. `quarkus.keycloak.devservices.image-name` can be used to change the Keycloak image name. For example, set it to `quay.io/keycloak/keycloak:17.0.0-legacy` to use a Keycloak distribution powered by WildFly.
ja_jp: Quarkus を利用した Keycloak ディストリビューションを含む `quay.io/keycloak/keycloak:17.0.0` イメージは、デフォルトでコンテナーを起動するために使用されます。 `quarkus.keycloak.devservices.image-name` を使用して、Keycloak イメージ名を変更できます。たとえば、WildFly を利用した Keycloak ディストリビューションを使用するには、これを `quay.io/keycloak/keycloak:17.0.0-legacy` に設定します。

source: The `quay.io/keycloak/keycloak:24.0.4` image which contains a Keycloak distribution powered by Quarkus is used to start a container by default. `quarkus.keycloak.devservices.image-name` can be used to change the Keycloak image name. For example, set it to `quay.io/keycloak/keycloak:19.0.3-legacy` to use a Keycloak distribution powered by WildFly. Be aware that a Quarkus-based Keycloak distribution is only available starting from Keycloak `20.0.0`.
ja_jp: デフォルトでは、Quarkus を利用した Keycloak ディストリビューションを含む `quay.io/keycloak/keycloak:24.0.4` イメージがコンテナーの起動に使用されます。 `quarkus.keycloak.devservices.image-name` を使用して、Keycloak イメージ名を変更できます。 たとえば、WildFly を利用した Keycloak ディストリビューションを使用するには、これを `quay.io/keycloak/keycloak:19.0.3-legacy` に設定します。 Quarkus ベースの Keycloak ディストリビューションは、Keycloak `20.0.0` 以降でのみ利用可能であることに注意してください。

source: The `quay.io/keycloak/keycloak:26.1.3` image which contains a Keycloak distribution powered by Quarkus is used to start a container by default. `quarkus.keycloak.devservices.image-name` can be used to change the Keycloak image name. For example, set it to `quay.io/keycloak/keycloak:19.0.3-legacy` to use a Keycloak distribution powered by WildFly. Be aware that a Quarkus-based Keycloak distribution is only available starting from Keycloak `20.0.0`.
ja_jp: デフォルトでは、Quarkus を搭載した Keycloak ディストリビューションを含む `quay.io/keycloak/keycloak:26.1.3` イメージがコンテナーの起動に使用されます。 `quarkus.keycloak.devservices.image-name` を使用して、Keycloak イメージ名を変更できます。 たとえば、WildFly を搭載した Keycloak ディストリビューションを使用するには、`quay.io/keycloak/keycloak:19.0.3-legacy` に設定します。 Quarkus ベースの Keycloak ディストリビューションは、Keycloak `20.0.0` 以降でのみ使用できることに注意してください。

source: The `quote-requests` channel is going to be managed as a AMQP queue, as that's the only connector on the classpath. If not indicated otherwise, like in this example, Quarkus uses the channel name as AMQP queue name. So, in this example, the application sends messages to the `quote-requests` queue.
ja_jp: `quote-requests` チャネルは AMQP キューとして管理されます。これは、クラスパス上の唯一のコネクターであるためです。特に明記されていない限り、この例のように、Quarkus はチャネル名を AMQP キュー名として使用します。したがって、この例では、アプリケーションはメッセージを `quote-requests` キューに送信します。

source: The `quote-requests` channel is going to be managed as a Kafka topic, as that's the only connector on the classpath. If not indicated otherwise, like in this example, Quarkus uses the channel name as topic name. So, in this example, the application writes into the `quote-requests` topic. Quarkus also configures the serializer automatically, because it finds that the `Emitter` produces `String` values.
ja_jp: `quote-requests` チャネルは、クラスパス上の唯一のコネクターであるため、Kafka トピックとして管理されます。特に明記されていない限り、この例のように、Quarkus はチャネル名をトピック名として使用します。したがって、この例では、アプリケーションは `quote-requests` トピックに書き込みます。Quarkus は、 `Emitter` が `String` 値を生成することを検出するため、シリアライザーも自動的に設定します。

source: The `quote-requests` channel is going to be managed as a Pulsar topic, as that's the only connector on the classpath. If not indicated otherwise, like in this example, Quarkus uses the channel name as topic name. So, in this example, the application writes into the `quote-requests` topic. Quarkus also configures the serializer automatically, because it finds that the `Emitter` produces `String` values.
ja_jp: `quote-requests` チャネルは、クラスパス上の唯一のコネクターであるため、Pulsar トピックとして管理されます。特に明記されていない限り、この例のように、Quarkus はチャネル名をトピック名として使用します。したがって、この例では、アプリケーションは `quote-requests` トピックに書き込みます。Quarkus は、 `Emitter` が `String` 値を生成することを検出するため、シリアライザーも自動的に設定します。

source: The `regex` - for routing with regular expressions, see https://vertx.io/docs/vertx-web/java/#_routing_with_regular_expressions[for more details]
ja_jp: `regex` - 正規表現を使用したルーティングについては、 https://vertx.io/docs/vertx-web/java/#_routing_with_regular_expressions[詳細] を参照してください。

source: The `reload` method returns a `boolean` indicating whether the reload was successful. A value of `true` means the reload operation was successful, not necessarily that there were updates to the certificates.
ja_jp: `reload` メソッドは、リロードが成功したかどうかを示す `boolean` を返します。 `true` 値は、リロード操作が成功したことを意味しますが、必ずしも証明書が更新されたことを意味するわけではありません。

source: The `room` field also has an `@PlanningVariable` annotation, for the same reasons.
ja_jp: 同じ理由で、 `room` フィールドにも `@PlanningVariable` アノテーションがあります。

source: The `router()` method returns a `io.vertx.ext.web.Router` object which can be used to register routes. The paths are relative to `/`. For example, the previous snippet registers a route on `/admin`. This route is accessible on `http://0.0.0.0:9000/admin`, if you use the default host and port.
ja_jp: `router()` メソッドは、ルートの登録に使用できる `io.vertx.ext.web.Router` オブジェクトを返します。ルートは、 `/` からの相対パスです。たとえば、前の例では、 `/admin` にルートを登録しています。デフォルトのホストとポートを使用する場合、このルートは `http://0.0.0.0:9000/admin` でアクセス可能です。

source: The `rss` command is the following function:
ja_jp: `rss` コマンドは以下の関数です。

source: The `run` method is invoked once Quarkus starts, and the application stops when it finishes.
ja_jp: Quarkus が起動すると `run` メソッドが呼び出され、アプリケーションが終了すると停止します。

source: The `runtime` module is where you develop the feature you want to propose to your users, so it's time to create our Web Servlet.
ja_jp: この `実行時` モジュールは、ユーザーに提案したい機能を開発するところなので、そろそろ Web Servlet を作成しましょう。

source: The `sam.yaml` syntax is beyond the scope of this document. There are a couple of things that must be highlighted just in case you are going to craft your own custom `sam.yaml` deployment files.
ja_jp: `sam.yaml` の構文はこのドキュメントの範囲を超えています。しかし、カスタムの `sam.yaml` デプロイメントファイルを作成しようとしている場合、幾つかの強調しなければならないことがあります。

source: The `sam.yaml` syntax is beyond the scope of this document. There's a couple of things that must be highlighted just in case you are going to craft your own custom `sam.yaml` deployment files.
ja_jp: `sam.yaml` の構文はこのドキュメントの範囲を超えています。しかし、カスタムの `sam.yaml` デプロイメントファイルを作成しようとしている場合、幾つかの強調しなければならないことがあります。

source: The `security-jpa` extension initializes only if a single entity is annotated with `@UserDefinition`.
ja_jp: `security-jpa` エクステンションは、単一のエンティティが `@UserDefinition` でアノテーションされている場合にのみ、初期化されます。

source: The `security-jpa` extension initializes only if there is a single entity annotated with `@UserDefinition`.
ja_jp: `security-jpa` エクステンションは、 `@UserDefinition` でアノテーションされた単一のエンティティーがある場合にのみ初期化されます。

source: The `security-jpa` extension is only initialized if there is a single entity annotated with `@UserDefinition`.
ja_jp: `security-jpa` エクステンションは、 `@UserDefinition` でアノテーションされた単一のエンティティーがある場合にのみ初期化されます。

source: The `security-jpa` extension requires at least one datasource to access to your database.
ja_jp: `security-jpa` エクステンションは、データベースにアクセスするために少なくとも一つのデータソースが必要です。

source: The `security-jwt-quickstart` link:{quickstarts-tree-url}/security-jwt-quickstart[directory] repository contains all the versions covered in this quickstart guide, along with additional endpoints that demonstrate subresources using injected `JsonWebToken` tokens and their claims via CDI APIs.
ja_jp: `security-jwt-quickstart` link:{quickstarts-tree-url}/security-jwt-quickstart[directory] リポジトリには、このクイックスタートガイドで扱うすべてのバージョンが含まれており、さらに CDI API を使用して `JsonWebToken` トークンとそのクレームを注入し、サブリソースを示す追加のエンドポイントも含まれています。

source: The `sendMultipartData` method gives our code the ability to POST a `multipart/form-data` request to our Echo service (running in the same server for demo purposes). Because in this demo we have the exact knowledge of the `multipart/form-data` packets, we can map them to the model class created in the previous section using the `@org.jboss.resteasy.annotations.providers.multipart.MultipartForm` annotation.
ja_jp: `sendMultipartData` メソッドは、コードに `multipart/form-data` リクエストをEchoサービスに POST する機能を与えます（デモ用に同じサーバーで実行しています）。このデモでは、 `multipart/form-data` パケットの正確に把握しているので、 `@org.jboss.resteasy.annotations.providers.multipart.MultipartForm` アノテーションを使用して、前のセクションで作成したモデルクラスにマッピングすることができます。

source: The `send` method writes records to Kafka inside the transaction, without waiting for send receipt from the broker. Messages pending to be written to Kafka will be buffered, and flushed before committing the transaction. It is therefore recommended configuring the `@OnOverflow` `bufferSize` in order to fit enough messages, for example the `max.poll.records`, maximum amount of records returned in a batch.
ja_jp: `send` メソッドは、ブローカーからの送信受信を待たずに、トランザクション内で Kafka にレコードを書き込みます。Kafka への書き込みが保留されているメッセージはバッファーリングされ、トランザクションをコミットする前にフラッシュされます。したがって、十分なメッセージ (たとえば、バッチで返されるレコードの最大量である `max.poll.records`) に適合するように、 `@OnOverflow` `bufferSize` を設定することを推奨します。

source: The `service key` is usually the name of the service, for example the name of the datasource, or the name of the `mongo` client. When this value is not available, the datasource type, such as `postgresql`, `mysql`, `mongo`, is used instead.
ja_jp: `service key` は通常、データソースの名前や `mongo` クライアントの名前など、サービスの名前です。この値がない場合は、`postgresql`、`mysql`、`mongo` などのデータソースのタイプが代わりに使用されます。

source: The `service.beta.openshift.io/inject-cabundle` annotation is used to inject the CA certificate into the ConfigMap. Note that the ConfigMap initially has no data — it is empty. During its processing, OpenShift injects the CA certificate into the ConfigMap in the `service-ca.crt` file.
ja_jp: `service.beta.openshift.io/inject-cabundle` アノテーションは、CA 証明書を ConfigMap に注入するために使用されます。 この ConfigMap は、最初はデータがなく、空であることに注意してください。 処理中に、OpenShift は CA 証明書を `service-ca.crt` ファイルの ConfigMap に注入します。

source: The `service` in the generated `ServiceBinding` then displays as follows:
ja_jp: 生成された `ServiceBinding` 内の `service` は、以下のように表示されます。

source: The `setExpireAfterAccess`, `setExpireAfterWrite` and `setMaximumSize` methods from `CaffeineCache` must never be invoked from within an atomic scope of a cache operation.
ja_jp: `CaffeineCache` の `setExpireAfterAccess` 、 `setExpireAfterWrite` 、 `setMaximumSize` メソッドは、 キャッシュ操作のアトミックスコープ内から決して呼び出してはいけません。

source: The `set` method can also receive a `SetArgs` argument that modify the behavior:
ja_jp: `set` メソッドは、動作を変更するための `SetArgs` 引数を受け取ることもできます。

source: The `settings.json` placed in the root of your project directory or in the workspace will need the following workaround in your test configuration:
ja_jp: プロジェクトディレクトリーやワークスペースのルートにある `settings.json` には、テスト設定で次の回避策が必要です:

source: The `smallrye.jwt.sign.key` and `smallrye.jwt.encrypt.key` properties can also contain Base64-encoded private or public key values directly.
ja_jp: `smallrye.jwt.sign.key` プロパティーと `smallrye.jwt.encrypt.key` プロパティーには、Base64 でエンコードされた秘密鍵または公開鍵の値を直接含めることもできます。

source: The `solve()` method starts a job to solve the current timetable and store the time slot and room assignments in the database. It uses the `SolverManager.solveAndListen()` method to listen to intermediate best solutions and update the database accordingly. This enables the UI to show progress while the backend is still solving.
ja_jp: `solve()` メソッドは、現在のタイムテーブルを解決し、タイムスロットと教室の割り当てをデータベースに保存するジョブを開始します。 `SolverManager.solveAndListen()` メソッドを使用して、中間の最適ソリューションをリッスンし、それに応じてデータベースを更新します。これにより、バックエンドが解決している間も、UI に進行状況を表示できます。

source: The `spec:filter:attributes:type` maps a Cloud Event type to the Kubernetes service defined in `spec:subscriber:ref`. When a Cloud Event is pushed to the Broker, it will trigger the spin up of the service mapped to that event.
ja_jp: `spec:filter:attributes:type` は、 `spec:subscriber:ref` で定義されている Kubernetes サービスにCloud Eventのタイプをマッピングします。Cloud EventがBrokerにプッシュされると、そのイベントにマッピングされたサービスのスピンアップがトリガーされます。

source: The `spring-data-jpa` extension will generate an implementation for this repository. Then the `spring-data-rest` extension will generate a REST CRUD resource for it.
ja_jp: `spring-data-jpa` エクステンションは、このリポジトリに対する実装を生成します。そして、 `spring-data-rest` エクステンションは、そのための REST CRUD リソースを生成します。

source: The `start` method is invoked by Quarkus before any test is run and returns a `Map` of configuration properties that apply during the test execution.
ja_jp: `start` メソッドは、テストを実行する前にQuarkusによって呼び出され、テスト実行中に適用される設定プロパティーの `Map` を返します。

source: The `state` is coming from the `KafkaStreams.State` enum.
ja_jp: `state` は `KafkaStreams.State` Enum から来ています。

source: The `stream` methods require a transaction to work.
ja_jp: `stream` メソッドを使うにはトランザクションが必要です。

source: The `stream` methods require a transaction to work. + As they perform I/O operations, they should be closed via the `close()` method or via a try-with-resource to close the underlying `ResultSet`. If not, you will see warnings from Agroal that will close the underlying `ResultSet` for you.
ja_jp: `stream` のメソッドは動作にトランザクションを必要とします。 また、これらのメソッドは I/O 操作を行うため `close()` メソッドや try-with-resource を介して基礎となる `ResultSet` を閉じなければなりません。そうしないと、Agroal からの警告が表示され、基礎となる `ResultSet` を閉じてくれます。

source: The `target/manage.sh` script is for managing your Funqy function using the AWS Lambda Java runtime. This script is provided only for your convenience. Examine the output of the `manage.sh` script if you want to learn what aws commands are executed to create, delete, and update your functions.
ja_jp: `target/manage.sh` スクリプトは、AWS Lambda Java ランタイムを使用して Funqy 関数を管理するためのものです。このスクリプトは利便性のためだけに提供されています。関数の作成、削除、更新のためにどのような aws コマンドが実行されるかを知りたい場合は、`manage.sh` スクリプトの出力を確認してください。

source: The `target/manage.sh` script is for managing your lambda using the AWS Lambda Java runtime. This script is provided only for your convenience. Examine the output of the `manage.sh` script if you want to learn what aws commands are executed to create, delete, and update your lambdas.
ja_jp: `target/manage.sh` スクリプトは、AWS Lambda Java ランタイムを使用して Lambda を管理するためのものです。このスクリプトは利便性のためだけに提供されています。Lambda の作成、削除、更新のためにどのようなawsコマンドが実行されるかを知りたい場合は、 `manage.sh` スクリプトの出力を確認してください。

source: The `temperature-values` topic is read into a `KStream`; whenever a new message arrives to this topic, the pipeline will be processed for this measurement
ja_jp: `temperature-values` トピックは `KStream` に読み込まれます。このトピックに新しいメッセージが到着するたびに、パイプラインはこの測定のために処理されます

source: The `tenant-a` application type is `hybrid`; it can accept HTTP bearer tokens if provided. Otherwise, it initiates an authorization code flow when authentication is required.
ja_jp: `tenant-a` アプリケーションタイプは `hybrid` です。提供されている場合、HTTP ベアラートークンを受け入れることができます。 それ以外の場合は、認証が必要なときに認可コードフローを開始します。

source: The `timeZone` attribute supports <<config-reference#property-expressions,Property Expressions>> including default values and nested Property Expressions.
ja_jp: `timeZone` 属性はデフォルト値とネストされた値のプロパティー式を含む <<config-reference#property-expressions,Property Expressions>> をサポートします。

source: The `timeZone` attribute supports xref:config-reference.adoc#property-expressions[Property Expressions] including default values and nested Property Expressions.
ja_jp: `timeZone` 属性は、デフォルト値やネストしたProperty Expressionを含む xref:config-reference.adoc#property-expressions[Property Expression] に対応しています。

source: The `timeslotList` and `roomList` fields have an `@ProblemFactCollectionProperty` annotation, so your `TimeTableConstraintProvider` can select _from_ those instances.
ja_jp: `timeslotList` フィールドと `roomList` フィールドには `@ProblemFactCollectionProperty` アノテーションがあるため、 `TimeTableConstraintProvider` はこれらのインスタンス_から_選択できます。

source: The `timeslotList` field is a value range provider. It holds the `Timeslot` instances which OptaPlanner can pick from to assign to the `timeslot` field of `Lesson` instances. The `timeslotList` field has an `@ValueRangeProvider` annotation to connect the `@PlanningVariable` with the `@ValueRangeProvider`, by matching the type of the planning variable with the type returned by the value range provider.
ja_jp: `timeslotList` フィールドは、値域プロバイダーです。これは `Timeslot` インスタンスを保持し、OptaPlanner が `timeslot` フィールドの `Lesson` インスタンスに割り当てるために選択することができます。 `timeslotList` フィールドには `@ValueRangeProvider` アノテーションがあり、計画変数の型と値域プロバイダーが返す型を一致させて、 `@PlanningVariable` と `@ValueRangeProvider` を接続します。

source: The `timeslotList` field is a value range provider. It holds the `Timeslot` instances which OptaPlanner can pick from to assign to the `timeslot` field of `Lesson` instances. The `timeslotList` field has an `@ValueRangeProvider` annotation to connect the `@PlanningVariable` with the `@ValueRangeProvider`, by matching the value of the `id` property with the value of the `valueRangeProviderRefs` property of the `@PlanningVariable` annotation in the `Lesson` class.
ja_jp: `timeslotList` フィールドは値の範囲プロバイダーです。これは、OptaPlanner が `Lesson` インスタンスの `timeslot` フィールドに割り当てるために選択できる `Timeslot` インスタンスを保持します。 `timeslotList` フィールドには `@ValueRangeProvider` アノテーションがあり、 `id` プロパティーの値を `Lesson` クラスの `@PlanningVariable` アノテーションの `valueRangeProviderRefs` プロパティーの値と照合することにより、 `@PlanningVariable` を `@ValueRangeProvider` に接続します。

source: The `timeslot` field has an `@PlanningVariable` annotation, so OptaPlanner knows that it can change its value. In order to find potential `Timeslot` instances to assign to this field, OptaPlanner uses the `valueRangeProviderRefs` property to connect to a value range provider (explained later) that provides a `List<Timeslot>` to pick from.
ja_jp: `timeslot` フィールドには `@PlanningVariable` アノテーションがあるため、OptaPlanner はその値を変更できることを認識しています。このフィールドに割り当てる可能性のある `Timeslot` インスタンスを見つけるために、OptaPlanner は `valueRangeProviderRefs` プロパティーを使用して、選択元となる `List<Timeslot>` を提供する値の範囲プロバイダー (後で説明) に接続します。

source: The `timeslot` field has an `@PlanningVariable` annotation, so OptaPlanner knows that it can change its value. In order to find potential Timeslot instances to assign to this field, OptaPlanner uses the variable type to connect to a value range provider that provides a List<Timeslot> to pick from.
ja_jp: `timeslot` フィールドには `@PlanningVariable` アノテーションがあるので、OptaPlanner はその値を変更することができることを知っています。このフィールドに割り当てるTimeslotインスタンスの候補を見つけるために、OptaPlannerは変数タイプを使用して、List<Timeslot>から選択することを提供する値域プロバイダーに接続します。

source: The `track-config-changes` goal looks for `${project.basedir}/.quarkus/quarkus-prod-config-dump` (file name and directory are configurable) and, if the file already exists, checks whether the values stored in the config dump have changed. It will log the changed options and save the current values of each of the options present in `${project.basedir}/.quarkus/quarkus-prod-config-dump` in `${project.basedir}/target/quarkus-prod-config.check` (the target file name and location can be configured). If the build time configuration has not changed since the last build both `${project.basedir}/.quarkus/quarkus-prod-config-dump` and `${project.basedir}/.quarkus/quarkus-prod-config-dump` will be identical.
ja_jp: `track-config-changes` ゴールは `${project.basedir}/.quarkus/quarkus-prod-config-dump` (ファイル名とディレクトリーは設定可能) を検索し、ファイルがすでに存在する場合は、設定ダンプに保存されている値が変更されているかどうかを確認します。 変更されたオプションを記録し、 `${project.basedir}/target/quarkus-prod-config.check` (ターゲットファイル名と場所は設定可能) の `${project.basedir}/.quarkus/quarkus-prod-config-dump` にある各オプションの現在の値を保存します。ビルド時の設定が前回のビルドから変更されていない場合は、 `${project.basedir}/.quarkus/quarkus-prod-config-dump` と `${project.basedir}/.quarkus/quarkus-prod-config-dump` はまったく同じになります。

source: The `transform` method applies the transformation function to the current state, producing a changed state and registering it locally for checkpointing. By default, the local state is persisted to the state store periodically, period specified by `auto.commit.interval.ms`, (default: 5000). If `persistOnAck` flag is given, the latest state is persisted to the state store eagerly on message acknowledgment. The `setNext` method works similarly directly setting the latest state.
ja_jp: `transform` メソッドは、現在の状態に変換関数を適用し、変更された状態を生成して、チェックポイントのためにローカルに登録します。デフォルトでは、ローカルの状態は、 `auto.commit.interval.ms` で指定された期間、定期的にステートストアに永続化されます（デフォルト：5000）。 `persistOnAck` フラグが与えられている場合、最新の状態は、メッセージの確認応答時にステートストアにeagerlyに永続化されます。 `setNext` メソッドも同様に、最新の状態を直接設定するように動作します。

source: The `type` - it can be _normal_ (non-blocking), _blocking_ (method dispatched on a worker thread), or _failure_ to indicate that this route is called on failures
ja_jp: `type` - _normal_ (ノンブロッキング)、_blocking_ (ワーカスレッドにディスパッチされるメソッド)、あるいは _failure_ で、失敗時にこのルートが呼び出されることを示します。

source: The `type` field is required.
ja_jp: `type` フィールドは必須です。

source: The `upn` claim is defined by the {mp-jwt} spec as preferred claim to use for the `Principal` seen via the container security APIs.
ja_jp: `upn` クレームは、{mp-jwt} 仕様で、コンテナーセキュリティー API を介して表示される `Principal` に使用する優先クレームとして定義されています。
